evidence/load-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_128_GCM_SHA256,2048,128
TLS Server Name:        localhost

Document Path:          /catalog/health
Document Length:        19 bytes

Concurrency Level:      10
Time taken for tests:   0.103 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    100
Total transferred:      20000 bytes
HTML transferred:       1900 bytes
Requests per second:    972.28 [#/sec] (mean)
Time per request:       10.285 [ms] (mean)
Time per request:       1.029 [ms] (mean, across all concurrent requests)
Transfer rate:          189.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.3      0      13
Processing:     0    5  12.5      0      46
Waiting:        0    5  12.4      0      43
Total:          0    6  15.7      0      54

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%     50
  95%     53
  98%     54
  99%     54
 100%     54 (longest request)