evidence/load-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_128_GCM_SHA256,2048,128
TLS Server Name:        localhost

Document Path:          /catalog/health
Document Length:        19 bytes

Concurrency Level:      10
Time taken for tests:   0.102 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    100
Total transferred:      20000 bytes
HTML transferred:       1900 bytes
Requests per second:    978.69 [#/sec] (mean)
Time per request:       10.218 [ms] (mean)
Time per request:       1.022 [ms] (mean, across all concurrent requests)
Transfer rate:          191.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.0      0      13
Processing:     0    5  12.3      0      43
Waiting:        0    4  12.2      0      41
Total:          0    6  15.2      0      54

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      1
  80%      1
  90%     48
  95%     51
  98%     53
  99%     54
 100%     54 (longest request)